{"about":{"slug":"about","filePath":"about.md","title":"About","links":[],"tags":[],"content":"About AJ\nThe Multi-Faceted Being of Pure Energy\nI’m AJ Van Beest - cybersecurity professional, sailing enthusiast, pickleball player, and general technology experimenter. Currently working in Detection Engineering while exploring the intersection of AI, automation, and security.\nWhat I Do\nProfessional: Detection Engineering, threat hunting, security operations. I’ve worked across endpoint detection, vulnerability management, and building security tooling.\nPersonal: Sailing adventures, pickleball 3-4x per week, weight management journey (293→220 lbs and counting), and building autonomous AI systems for fun.\nTechnical: Background work systems, N8N automation, MCP ecosystem development, and whatever interesting problems need solving.\nCurrent Projects\n\nBackground Work System: Autonomous AI task processing (Phase 1 complete)\nN8N Autonomous Integration: Full workflow management capabilities\nThis Website: Digital gardening with Claude as co-author\nSecret Management: Infrastructure for secure automation\n\nPhilosophy\nFuck around and find out. Learn by doing. Build things that are useful, even if they’re not perfect. Collaborate with AI to amplify capabilities.\nContact\n\nEmail: ajvanbeest@protonmail.com\nGitHub: @theaj42\nDomain: ajvanbeest.com\n\n\nPage co-authored with Claude."},"index":{"slug":"index","filePath":"index.md","title":"Welcome to AJ's Digital Garden","links":[],"tags":[],"content":"Hey there! 👋\nWelcome to my corner of the internet. This is a digital garden where I experiment, hack, think out loud, and occasionally say something useful.\nWhat You’ll Find Here\n\nExperiments: Tech projects, security research, random hacks\nThoughts: Ideas that need somewhere to live\nProjects: Things I’m building (with help from Claude)\nProfessional: Resume and work stuff (such as it is)\n\nThe Vibe\nI’m more interested in experimenting and learning than building a “professional presence.” That said, I’m not a complete slob who doesn’t care about others. This site is a collaboration between me and Claude - we’re figuring it out as we go.\nRecent Posts\nCheck out the latest posts in the explorer or use the search to find something specific.\n\nBuilt with Quartz + Obsidian. Code available on GitHub."},"posts/hello-world":{"slug":"posts/hello-world","filePath":"posts/hello-world.md","title":"Hello World: Building a Digital Garden","links":[],"tags":["meta","website","collaboration"],"content":"Hello World: Building a Digital Garden\nWell, here we are. After years of thinking “I should have a website,” I’m finally doing something about it. But here’s the twist - I’m building it with Claude as my co-author and technical partner.\nWhy Now?\nHonestly? I got tired of having ideas bounce around in my head with nowhere to put them. I want a place to:\n\nDocument experiments and projects\nShare things I’ve learned (especially the hard way)\nCollaborate with AI in public\nMaybe help others who are doing similar things\n\nThe Stack\nWe went with Quartz + Obsidian because:\n\nLow friction: Write in Obsidian, add #publish, boom - it’s live\nNo bullshit: Static site, fast, simple\nVersion controlled: Everything in git for proper collaboration\nFree hosting: GitHub Pages does the job\n\nCo-Authoring with AI\nThis is the interesting part. Claude isn’t just helping me build the site - we’re genuinely collaborating on content. Some posts will be mine, some will be Claude’s, and some (like this one) we’ll write together.\nThe plan is to be transparent about authorship. If Claude writes something, Claude gets credit. If we collaborate, we both get credit. Simple.\nWhat’s Next?\nWe’ll see what happens. I’m planning to write about:\n\nTechnical projects and experiments\nCybersecurity work and research\nAI collaboration and automation\nSailing adventures and life stuff\nWhatever seems interesting\n\nNo grand plan, no content strategy. Just fuck around and find out.\n\nThis post was co-authored by AJ Van Beest and Claude. The site is open source at github.com/theaj42/ajvanbeest-com."}}